### 판다스, 데이터프레임, 시리즈 알아보기  
  
[참고사이트] (https://www.youtube.com/watch?v=pFXipjh0ghw&index=1&list=PLVNY1HnUlO26Igldy2Q6Nb2LZbpQWTyle)

In [232]:
import pandas as pd

In [239]:
data_frame = pd.read_csv('data/friend_list.csv')

data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

데이터 프레임에서 각 칼럼들이 series(시리즈),   
시리즈로 구성된것이 데이터 프레임이라고 할 수 있음 -> 데이터프레임은 시리즈의 결합체   
시리즈느 파이썬 리스트로 만들 수 있음.

In [241]:
type(data_frame.name)

pandas.core.series.Series

In [245]:
# 시리즈 만들기
s1 = pd.core.series.Series([ 1, 2, 3])

In [246]:
s2 = pd.core.series.Series(['one', 'two', 'three'])

In [247]:
pd.DataFrame(data = dict(num = s1, word = s2))

   num   word
0    1    one
1    2    two
2    3  three

### [Pandas] 파일에서 데이터 불러오기
[참고사이트](https://www.youtube.com/watch?v=gZJlHxpmyI0)

In [2]:
import pandas as pd

In [5]:
# 파일에서 데이터 불러오기
df = pd.read_csv('data/friend_list.csv')

In [7]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [9]:
# txt파일 불러오기
df = pd.read_csv('data/friend_list.txt')

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
# 탭(tab)으로 구분된 파일 불러오기
df = pd.read_csv('data/friend_list_tab.txt', delimiter ='\t')

In [14]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [16]:
# 헤드 정보가 없는 데이터 불러올때
df = pd.read_csv('data/friend_list_no_head.csv')

In [17]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [19]:
# 파라미터에 header = None을 지정하여 헤드가 없는 파일이라고 알려줌
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [20]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [21]:
# 칼럼명을 넣어주고 싶다면
df.columns = [ 'name', 'age', 'job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [22]:
# 칼럼명이 없는 데이터에 칼럼명을 지정하여 불러오는 방법(1line)
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [23]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

### [Pandas] 데이터 프레임 생성하기
[참고사이트](https://www.youtube.com/watch?v=f7rJEQy9yd0)

In [39]:
# 딕셔너리로 데이터프레임 생성
friend_dict_list = [
    { 'name' : 'John', 'age' : 25, 'job' : 'student'},
    { 'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]

In [26]:
df = pd.DataFrame(friend_dict_list)

In [28]:
df.head()

# 딕셔너리에서 키값은 순서를 보장해주지 않음

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [29]:
df = df[['name', 'age', 'job']]

In [30]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [32]:
# 파이썬에서는 ordered dictionary를 지원함
# ordered dictionary는 key의 순서를 보장함.
from collections import OrderedDict

In [35]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [38]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [40]:
# 리스트로 데이터 프레임 생성
friend_list = [
    [ 'John', 20, 'student'],
    [ 'Nate', 30, 'teacher']
]

In [41]:
column_name = [ 'name', 'age', 'job']

In [42]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [43]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [44]:
friend_list = [
    [ 'name', ['John', 'Nate']],
    [ 'age', [ 20, 30]],
    [ 'job', ['student', 'teacher']],
]

In [46]:
df = pd.DataFrame.from_items(friend_list)
df

C:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

   name  age      job
0  John   20  student
1  Nate   30  teacher

### 데이터프레임 파일로 저장하기

In [222]:
friends  = [
    { 'name' : 'John', 'age' : 20, 'job' : 'student'},
    { 'name' : 'Jenny', 'age' : 30, 'job' : None},
    { 'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friends)
df = df[[ 'name', 'age', 'job']]

In [223]:
df.head()

    name  age      job
0   John   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [226]:
# csv 파일로 데이터 프레임 저장
df.to_csv('data/friends.csv') # index = True, head = True가 디폴트로 설정되어있음.

In [227]:
# row_id 생략하고 싶을때
df.to_csv('data/friends.csv', index = False)

In [231]:
# None값이 데이터 프레임에 있으면 빈값으로 액셀에 들어감
# 이 빈값에 뭔가 대체하고 싶을때 na_rep 파라미터값을 설정해준다.
df.to_csv('data/friends.csv', index = False, header = False, na_rep = '-')

### 데이터 프레임 행(row), 열(column) 선택 및 필터
[참고사이트](https://www.youtube.com/watch?v=vcjoWVAwFBc)

In [47]:
import pandas as pd

In [49]:
friend_list = [
    [ 'name', [ 'John', 'Jenny', 'Nate' ]],
    [ 'age', [20 , 30, 30]],
    [ 'job', ['student', 'developer', 'teacher']]
]

df = pd.DataFrame.from_items(friend_list)

C:\Anaconda\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

In [50]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [51]:
# Jenny와 Nate 정보만 가져오고 싶을때
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [56]:
df = df [1:3]
df

   name  age      job
2  Nate   30  teacher

In [57]:
friend_list = [
    [ 'name', [ 'John', 'Jenny', 'Nate' ]],
    [ 'age', [20 , 30, 30]],
    [ 'job', ['student', 'developer', 'teacher']]
]

df = pd.DataFrame.from_items(friend_list)
df

C:\Anaconda\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [58]:
# John과 Nate의 정보를 가져오고 싶을때
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [59]:
# 나이가 25세 이상인 사람에 대한 데이터만 가져오고 싶을때
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [60]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [63]:
# 나이가 25세 이상이고, 이름이 Nate인 데이터만 불러오고 싶을때
df[(df.age > 25) & (df.name =='Nate')]

   name  age      job
2  Nate   30  teacher

In [66]:
friend_list = [
    [ 'John', 20, 'student'],
    [ 'Jenny', 30, 'developer'],
    [ 'Nate', 30, 'teacher']
]

df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [67]:
# 칼럼 0번부터 1번까지만 원할때
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

<b>df.iloc[: , 0:2] </b>     
iloc에서 `,` 앞부분 `:`은 행을 의미 -> 행 전체를 가져오겠다는뜻   
`,` 뒷부분은 열을 의미 -> `0:2`은 0,1번 열을 가져오겠다는뜻

In [68]:
# 행도 0부터 1까지, 열도 0부터 1까지 가져오고 싶을때
df.iloc[0:2, 0:2]

       0   1
0   John  20
1  Jenny  30

In [69]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [70]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [74]:
# 데이터에서 이름과 나이 필드만 가져오고 싶을때
df_filtered = df[[ 'name', 'age']]

In [75]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [76]:
# age와 job 필드만 가져올때 (df.filter 함수 이용)
df.filter(items = ['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [77]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [79]:
# 컬럼이름 중 a가 들어가는 데이터를 가져오고 싶을때
df.filter(like='a', axis=1)
#name과 age 칼럼에 내용들만 가져오는것을 확인할 수 있다.

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [80]:
# b로 끝나는 칼럼명만 정규식으로 가져와보기
df.filter(regex = 'b$', axis = 1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

### 데이터 그룹 만들기  (group by)    
  
[참고사이트](https://www.youtube.com/watch?v=y1AM0CmgK7k)

In [81]:
import pandas as pd

In [82]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]

In [83]:
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [84]:
# 각 학과별로 몇명 있는지 알아보기
groupby_major = df.groupby('major')

In [86]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [93]:
# 조금더 보기쉽게 
for name, group in groupby_major:
    print(name + " : " + str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [96]:
# 학과별로 몇명있는지 데이터 프레임 만들어보기
df_major_cnt = pd.DataFrame( {'count' : groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [98]:
groupby_sex = df.groupby('sex')

In [99]:
for name, group in groupby_major:
    print(name + " : " + str(len(group)))
    print(group)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

### 데이터 프레임 행,열 삭제하기    

[참고 사이트](https://www.youtube.com/watch?v=jWIHyJNV8RA&index=6&list=PLVNY1HnUlO26Igldy2Q6Nb2LZbpQWTyle)

In [100]:
import pandas as pd

In [113]:
friends = [
    { 'age' : 15, 'job' : 'student'},
    { 'age' : 25, 'job' : 'developer'},
    { 'age' : 30, 'job' : 'teacher'}
]

In [114]:
df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'], columns = ['age', 'job'])

In [115]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [116]:
# John과 Nate정보  삭제하기
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [106]:
# 삭제하고 싶은 정보를 기존의 데이터프레임에 반영시키고 싶으면
df = df.drop(['John', 'Nate'])

In [107]:
df

       age        job
Jenny   25  developer

In [108]:
df = pd.DataFrame(friends, index = ['John', 'Jenny', 'Nate'], columns = ['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [109]:
# drop 함수에서 파라미터값으로 inplace = True 해주면 바로 데이터 프레임에 적용됨
df.drop(['John', 'Nate'], inplace = True)
df

       age        job
Jenny   25  developer

In [119]:
friends = [
    { 'name' : 'John', 'age' : 15, 'job' : 'student'},
    { 'name' : 'Ben', 'age' : 25, 'job' : 'developer'},
    { 'name' : 'Jenny', 'age' : 30, 'job' : 'teacher'}
]

df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])

In [120]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [121]:
#John 하고 Jenny를 index가지고 삭제하기
df = df.drop(df.index[ [0, 2] ])
df

  name  age        job
1  Ben   25  developer

In [122]:
# 데이터 프레임 복원
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [124]:
# 나이가 20살 이상인 데이터만 삭제하기
df = df[df.age >= 20]
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [125]:
# 데이터 프레임 복원
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [126]:
# age 칼럼을 삭제 
df = df.drop('age', axis = 1) # age는 칼럼정보이므로 axis=1 설정해줌.

In [127]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

### 행과 열 생성 및 수정하기

In [130]:
friend_dict_list = [
    { 'name' : 'Jone', 'age' : 15, 'job' : 'student'},
    { 'name' : 'Jenny', 'age' : 30, 'job' : 'developer'},
    { 'name' : 'Nate', 'age' : 30, 'job' : 'teacher' }
]

df = pd.DataFrame(friend_dict_list, columns = [ 'name', 'age', 'job'])

In [132]:
# 3개의 행, 3개의 열을 확인가능
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [133]:
# 연봉(salary)열을 추가해보자  
df['salary'] = 0

In [134]:
df.head()

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [138]:
# numpy를 이용해서 studnet이면 연봉이 없고, student가 아니면 연봉이 있다고 표시
import numpy as np

In [141]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [143]:
df.head()

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [163]:
friend_dict_list = [
    { 'name' : 'Jone', 'midterm' : 95, 'final' : 85},
    { 'name' : 'Jenny', 'midterm' : 85, 'final' : 80},
    { 'name' : 'Nate', 'midterm' : 30, 'final' : 10 }
]

df = pd.DataFrame(friend_dict_list, columns = [ 'name', 'midterm', 'final'])

In [164]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [165]:
#총점을 추가해보자
df['total'] = df['midterm'] + df['final']

In [166]:
df.head()

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [167]:
#평균점수
df['average'] = df['total'] / 2

In [168]:
df.head()

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [169]:
# 성적별 등급을 매겨보자.
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
        
df['grade'] = grades

In [170]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [171]:
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

In [172]:
df.grade = df.grade.apply(pass_or_fail)

In [173]:
df

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [176]:
date_list = [ 
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    }
]


df = pd.DataFrame(date_list, columns = [ 'yyyy-mm-dd'])

In [177]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [178]:
# 년도(yyyy)만 따로 빼고 싶을때
def extract_year(row):
    return row.split('-')[0]

In [179]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [180]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [182]:
# 행추가 실습을 위해 데이터프레임 초기화
friend_dict_list = [
    { 'name' : 'Jone', 'midterm' : 95, 'final' : 85},
    { 'name' : 'Jenny', 'midterm' : 85, 'final' : 80},
    { 'name' : 'Nate', 'midterm' : 30, 'final' : 10 }
]

df = pd.DataFrame(friend_dict_list, columns = [ 'name', 'midterm', 'final'])

In [183]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [185]:
df2 = pd.DataFrame([
    ['Ben', 50, 50],
],columns = ['name', 'midterm', 'final']
)

In [186]:
df2

  name  midterm  final
0  Ben       50     50

In [188]:
df.append(df2, ignore_index = True)

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50

### 중복데이터 삭제하기

In [190]:
student_list = [
    {
        'name' : 'John',
        'major' : "Computer Science",
        'sex' : "male"
    },
    {
        'name' : 'Nate',
        'major' : "Computer Science",
        'sex' : "male"
    },
    {
        'name' : 'Edward',
        'major' : "Computer Science",
        'sex' : "male"
    },
    {
        'name' : 'Zara',
        'major' : "Psychology",
        'sex' : "female"
    },
    {
        'name' : 'John',
        'major' : "Computer Science",
        'sex' : "male"
    }
]

df = pd.DataFrame(student_list, columns = [ 'name', 'major', 'sex'])
df

# 0번째 데이터와 4번째 데이터가 중복되어있음

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [192]:
df.duplicated()

# 4 True : 4번행이 중복이라는뜻

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [194]:
# 중복데이터 삭제
df.drop_duplicates()

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [195]:
# 열에 있는 데이터로 중복된 값 제거하기

student_list = [
    {
        'name' : 'John',
        'major' : "Computer Science",
        'sex' : "male"
    },
    {
        'name' : 'Nate',
        'major' : "Computer Science",
        'sex' : "male"
    },
    {
        'name' : 'Edward',
        'major' : "Computer Science",
        'sex' : "male"
    },
    {
        'name' : 'Zara',
        'major' : "Psychology",
        'sex' : "female"
    },
    {
        'name' : 'Wendy',
        'major' : "Economics",
        'sex' : "female"
    },
    {
        'name' : 'Nate',
        'major' : None,
        'sex' : "male"
    },
    {
        'name' : 'John',
        'major' : "Economics",
        'sex' : "female"
    }
]

df = pd.DataFrame(student_list, columns = [ 'name', 'major', 'sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics  female

In [197]:
df.duplicated()

# 정확히 일치하는 행이 없기때문에 dulicated()함수에서는 중복확인이 안됨

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [199]:
 # 이름(name)이 중복값이 있는지 확인하고 싶을때
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [204]:
# 이름이 중복된 행을 삭제하자
# keep = 'first'라고 파라미터값을 주면,중복이 있을 경우 처음나온 행은 살림
# keep 값 없을때는 디폴트는 first임
df.drop_duplicates(['name'], keep = 'first')

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female

In [205]:
# keep = 'last라고 파라미터값을 주면 중복이 있을 경우 마지막에 나온 행을 살림
df.drop_duplicates(['name'], keep = 'last')

     name             major     sex
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics  female

### Nan값 찾고 원하는값으로 변경하기

In [207]:
school_id_list   = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [211]:
df.info()

# name은 8개가 null값이 아니고,
# job은 8개가 null값이 아니고,
# age는 6개가 null값이 아닌것을 확인할 수 있음.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
name    8 non-null object
job     8 non-null object
age     6 non-null float64
dtypes: float64(1), object(2)
memory usage: 272.0+ bytes

In [212]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [214]:
df.isnull()  # null값이 True로 표시됨

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [215]:
# age에 null값을 0으로 바꿔보자.
df.age = df.age.fillna(0)

In [216]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [217]:
# 나이값이 없으면 medium값으로 넣어주자
# 데이터 복구
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [220]:
# 직업별로 중간값을 얻어와서 Nan값을 채워줌
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True)

In [221]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0